# Agenda for today

## First, the debugger

In [1]:
def mysum(*numbers):
    total = 0
    for one_number in numbers:
        total += one_number
    return total

In [2]:

mysum(10, 20, 30)

60

In [3]:
mysum(100, 200, 300)

600

In [5]:
mysum([10, 20, 30])

TypeError: unsupported operand type(s) for +=: 'int' and 'list'

## Next, serious stuff

### Serious 1

### Serious 2

### Serious 3

# Final stuff

Hello!

# Actual agenda

1. Multi-indexing
2. Sorting
3. Grouping
4. Pivot tables

Download the data files from here:

https://files.lerner.co.il/pandas-workout-data.zip

In [7]:
import pandas as pd
from pandas import Series, DataFrame

In [8]:
import numpy as np

In [9]:
df = DataFrame(np.random.randint(0, 1000, [4, 5]),
               index=list('abcd'),
               columns=list('vwxyz'))

In [10]:
df

     v    w    x    y    z
a   40  128  238  840  321
b  288  748  292  867  939
c  917  942  832  391  657
d  945  345  211  343  525

In [12]:
# reset_index -- turns the index into a regular column

df = df.reset_index()
df

  index    v    w    x    y    z
0     a   40  128  238  840  321
1     b  288  748  292  867  939
2     c  917  942  832  391  657
3     d  945  345  211  343  525

In [15]:
df.columns = list('uvwxyz')

In [16]:
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [17]:
help(df.reset_index)

Help on method reset_index in module pandas.core.frame:

reset_index(level: 'IndexLabel' = None, *, drop: 'bool' = False, inplace: 'bool' = False, col_level: 'Hashable' = 0, col_fill: 'Hashable' = '', allow_duplicates: 'bool | lib.NoDefault' = <no_default>, names: 'Hashable | Sequence[Hashable]' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Reset the index, or a level of it.

    Reset the index of the DataFrame, and use the default one instead.
    If the DataFrame has a MultiIndex, this method can remove one or more
    levels.

    Parameters
    ----------
    level : int, str, tuple, or list, default None
        Only remove the given levels from the index. Removes all levels by
        default.
    drop : bool, default False
        Do not try to insert index into dataframe columns. This resets
        the index to the default integer index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    col_level : int or str, default 0
        If the columns have multiple levels, determines which level the
        labels are inserted into. By default it is inserted into the first
        level.
    col_fill : object, default ''
        If the columns have multiple levels, determines how the other
        levels are named. If None then the index name is repeated.
    allow_duplicates : bool, optional, default lib.no_default
        Allow duplicate column labels to be created.

        .. versionadded:: 1.5.0

    names : int, str or 1-dimensional list, default None
        Using the given string, rename the DataFrame column which contains the
        index data. If the DataFrame has a MultiIndex, this has to be a list or
        tuple with length equal to the number of levels.

        .. versionadded:: 1.5.0

    Returns
    -------
    DataFrame or None
        DataFrame with the new index or None if ``inplace=True``.

    See Also
    --------
    DataFrame.set_index : Opposite of reset_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame([('bird', 389.0),
    ...                    ('bird', 24.0),
    ...                    ('mammal', 80.5),
    ...                    ('mammal', np.nan)],
    ...                   index=['falcon', 'parrot', 'lion', 'monkey'],
    ...                   columns=('class', 'max_speed'))
    >>> df
             class  max_speed
    falcon    bird      389.0
    parrot    bird       24.0
    lion    mammal       80.5
    monkey  mammal        NaN

    When we reset the index, the old index is added as a column, and a
    new sequential index is used:

    >>> df.reset_index()
        index   class  max_speed
    0  falcon    bird      389.0
    1  parrot    bird       24.0
    2    lion  mammal       80.5
    3  monkey  mammal        NaN

    We can use the `drop` parameter to avoid the old index being added as
    a column:

    >>> df.reset_index(drop=True)
        class  max_speed
    0    bird      389.0
    1    bird       24.0
    2  mammal       80.5
    3  mammal        NaN

    You can also use `reset_index` with `MultiIndex`.

    >>> index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
    ...                                    ('bird', 'parrot'),
    ...                                    ('mammal', 'lion'),
    ...                                    ('mammal', 'monkey')],
    ...                                   names=['class', 'name'])
    >>> columns = pd.MultiIndex.from_tuples([('speed', 'max'),
    ...                                      ('species', 'type')])
    >>> df = pd.DataFrame([(389.0, 'fly'),
    ...                    (24.0, 'fly'),
    ...                    (80.5, 'run'),
    ...                    (np.nan, 'jump')],
    ...                   index=index,
    ...                   columns=columns)
    >>> df
                   speed species
                     max    type
    class  name
    bird   falcon  389.0     fly
           parrot   24.0     fly
    mammal lion     80.5     run
           monkey    NaN    jump

    Using the `names` parameter, choose a name for the index column:

    >>> df.reset_index(names=['classes', 'names'])
      classes   names  speed species
                         max    type
    0    bird  falcon  389.0     fly
    1    bird  parrot   24.0     fly
    2  mammal    lion   80.5     run
    3  mammal  monkey    NaN    jump

    If the index has multiple levels, we can reset a subset of them:

    >>> df.reset_index(level='class')
             class  speed species
                      max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    If we are not dropping the index, by default, it is placed in the top
    level. We can place it in another level:

    >>> df.reset_index(level='class', col_level=1)
                    speed species
             class    max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    When the index is inserted under another level, we can specify under
    which one with the parameter `col_fill`:

    >>> df.reset_index(level='class', col_level=1, col_fill='species')
                  species  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

    If we specify a nonexistent level for `col_fill`, it is created:

    >>> df.reset_index(level='class', col_level=1, col_fill='genus')
                    genus  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

In [18]:
df.index = range(1, len(df.index)+1)

In [19]:

df

   u    v    w    x    y    z
1  a   40  128  238  840  321
2  b  288  748  292  867  939
3  c  917  942  832  391  657
4  d  945  345  211  343  525

In [20]:
df.index

RangeIndex(start=1, stop=5, step=1)

In [21]:
# make v the index

df.set_index('v')

     u    w    x    y    z
v
40   a  128  238  840  321
288  b  748  292  867  939
917  c  942  832  391  657
945  d  345  211  343  525

In [22]:
df = df.set_index('v')

In [23]:
df

     u    w    x    y    z
v
40   a  128  238  840  321
288  b  748  292  867  939
917  c  942  832  391  657
945  d  345  211  343  525

In [24]:
df['v']

KeyError: 'v'

In [25]:
%xmode Minimal

Exception reporting mode: Minimal

In [26]:
df.index

Index([40, 288, 917, 945], dtype='int64', name='v')

In [27]:
df = df.reset_index()

In [28]:
df

     v  u    w    x    y    z
0   40  a  128  238  840  321
1  288  b  748  292  867  939
2  917  c  942  832  391  657
3  945  d  345  211  343  525

In [31]:
# get them in the "right" order
df = df[['u', 'v', 'w', 'x', 'y', 'z']]
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [32]:
# what happens if I set an index with more than one item?

df.set_index(['u', 'y'])

         v    w    x    z
u y
a 840   40  128  238  321
b 867  288  748  292  939
c 391  917  942  832  657
d 343  945  345  211  525

In [33]:
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [35]:
df['u'] = list('abab')
df['v'] = [10, 20, 30, 10]

In [37]:
df = df.set_index(['u', 'v'])
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [38]:
df.loc['a']

      w    x    y    z
v
10  128  238  840  321
30  942  832  391  657

In [39]:
df.loc[('a', 10)]

w    128
x    238
y    840
z    321
Name: (a, 10), dtype: int64

In [40]:
df.loc[['a', 10]]

KeyError: '[10] not in index'